In [8]:
df = pd.read_csv('spam.csv', encoding='latin1')

In [9]:
df.sample(5)

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
3714,ham,"I am late,so call you tomorrow morning.take ca...",NaN,NaN,NaN
2406,ham,One of best dialogue in cute reltnship..!! \We...,Dont Come Near My Body..!! Bcoz My Hands May ...,NaN,NaN
3237,ham,Good. No swimsuit allowed :),NaN,NaN,NaN
1994,ham,Have you been practising your curtsey?,NaN,NaN,NaN
2027,ham,No got new job at bar in airport on satsgettin...,NaN,NaN,NaN

In [10]:
 df.shape

(5572, 5)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   v1          5572 non-null   object
 1   v2          5572 non-null   object
 2   Unnamed: 2  50 non-null     object
 3   Unnamed: 3  12 non-null     object
 4   Unnamed: 4  6 non-null      object
dtypes: object(5)
memory usage: 217.8+ KB

In [12]:
df.drop(columns=['Unnamed: 2','Unnamed: 3','Unnamed: 4'],inplace=True)

In [13]:
df.sample(5)

        v1                                                 v2
1242   ham  Nobody can decide where to eat and dad wants C...
1025   ham   I have a sore throat. It's scratches when I talk
2063  spam  URGENT! Your mobile No *********** WON a å£2,0...
4238   ham  Sez, hows u & de arab boy? Hope u r all good g...
5490   ham                            K. I will sent it again

In [14]:
df.rename(columns={'v1':'target','v2':'text'},inplace=True)
df.sample(5)

     target                                               text
746     ham  I promise to take good care of you, princess. ...
3034    ham  Raji..pls do me a favour. Pls convey my Birthd...
1328    ham   My exam is for february 4. Wish you a great day.
2419   spam  SMS SERVICES For your inclusive text credits p...
4414    ham  Yeah I should be able to, I'll text you when I...

In [15]:
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()

In [16]:
df['target'] = encoder.fit_transform(df['target'])

In [17]:

df.head()

   target                                               text
0       0  Go until jurong point, crazy.. Available only ...
1       0                      Ok lar... Joking wif u oni...
2       1  Free entry in 2 a wkly comp to win FA Cup fina...
3       0  U dun say so early hor... U c already then say...
4       0  Nah I don't think he goes to usf, he lives aro...

In [18]:
df.isnull().sum()

target    0
text      0
dtype: int64

In [19]:
df.duplicated().sum()

np.int64(403)

In [20]:
df = df.drop_duplicates(keep='first')

In [21]:
df.duplicated().sum()

np.int64(0)